# CLI
brew "mas"        # Mac App Store command-line interface
brew "bash"       # Update Bash to 5.2+ (Apple won't distribute newer versions due to license concerns)
brew "fish"       # User-friendly command-line shell for UNIX-like operating systems
brew "midnight-commander"   # midnight-commander Terminal-based visual file manager
brew "tldr"       # Simplified and community-driven man pages
brew "tree"       # Display directories as trees (with optional color/HTML output)
brew "wget"       # Internet file retriever
brew "imagemagick"# Tools and libraries to manipulate images in many formats
brew "ffmpeg"     # Play, record, convert, and stream audio and video
brew "yt-dlp"     # Feature-rich command-line audio/video downloader
brew "speedtest-cli" # Command-line interface for https://speedtest.net bandwidth tests
brew "dockutil"   # Tool for managing dock items
cask "mysides"    # A simple CLI tool for Finder sidebar modification.
brew "btop"       # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "gum"        # Tool for glamorous shell scripts
brew "neofetch"   # Fast, highly customisable system info script

# Development tools
brew "git"        # Distributed revision control system
brew "git-lfs"    # Git Large File Storage
cask "fork"       # GIT client
cask "visual-studio-code"   # Open-source code editor

# Android development
cask "android-studio" # Tools for building Android applications 
cask "temurin"    # Required for ./gradlew projects - JDK from the Eclipse Foundation

# File management
cask "the-unarchiver" # Unpacks archive files
cask "android-file-transfer"  # Transfer files from and to an Android smartphone

# Browser
cask "google-chrome"  # Web browser

# Media
cask "yt-music"   # YouTube music client

# Tools
cask "monitorcontrol" # Tool to control external monitor brightness & volume

# Utilities
cask "chatgpt"    # OpenAI's official ChatGPT desktop app
cask "logi-options+"  # Software for Logitech devices
cask "appcleaner" # Application uninstaller
mas "Magnet", id: 441258766       # Window manager for Mac
mas "Amphetamine", id: 937984704  # Keep-awake utility for macOS
